# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\vmware-host\Shared Folders\OneDrive\Tech\GitHub\Arm\PWM_MUX\PWM_MUX.cydsn\PWM_MUX.cyprj
# Date: Mon, 09 Mar 2015 20:50:43 GMT
#set_units -time ns
create_clock -name {Clock_4(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for \\vmware-host\Shared Folders\OneDrive\Tech\GitHub\Arm\PWM_MUX\PWM_MUX.cydsn\TopDesign\TopDesign.cysch
# Project: \\vmware-host\Shared Folders\OneDrive\Tech\GitHub\Arm\PWM_MUX\PWM_MUX.cydsn\PWM_MUX.cyprj
# Date: Mon, 09 Mar 2015 20:50:39 GMT
